##print(2+2*2)
##print(17*15.4)
##a=10
##b=2022
##c=a+b
##print(c)

##a='Джон'
##print('привет,'+a)
##b='Алиса'
##print('привет,'+b)
##c='Боб'
##print('привет,'+c)
##d='Таннер'
##print('привет,'+d)
##e='Джейк'
##print('привет,'+e)

##a=5
##print(a**2)
##b=6
##print(b**2)
##c=2
##print(c**2)
##d=1
##print(d**2)
##e=10
##print(e**2)
##f=9
##print(f**2)
##g=7
##print(g**2)
##h=200
##print(h**2)

##a=3
##b=5
##print(a*b/2)
##c=10
##d=2
##print(c*d/2)
##e=179
##f=1534
##print(e*f/2)
##g=1543
##h=57
##print(g*h/2)

##a='Гарри!'
##b='привет, '
##print(b+a)
##a='мистер Поттер!'
##b='Здравствуйте, '
##print(b+a)
##a='Лорд Волондеморт!'
##b='Здравстуй, '
##print(b+a)

##n=15
##k=2022
##print(k//n)
##print(k%n)

##a=179
##b=' Следующая число за числом '
##c=' Предыдущая число для числа '
##print(b,a,a+1)
##print(c,a,a-1)
##
##a=0
##b=' Следующая число за числом '
##c=' Предыдущая число для числа '
##print(b,a,a+1)
##print(c,a,a-1)
##
##a=100
##b=' Следующая число за числом '
##c=' Предыдущая число для числа '
##print(b,a,a+1)
##print(c,a,a-1)

##a=15.3
##b=18.2
##c=60
##d=b-a
##e=d*c
##f=e*c
##print(f)

a=20
b=21
c=22
d=
print(d)























